Revit 2025 API
MassSurfaceDataSource Enumeration
 Indicates whether values for the properties of the MassSurfaceData are synchronized with the EnergyDataSettings of the document or instead, serve as overrides of those settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum MassSurfaceDataSource
Public Enumeration MassSurfaceDataSource
public enum class MassSurfaceDataSource
type MassSurfaceDataSource
Members
Member name | Value | Description
EnergyData | 0 |  Synchronize with the EnergyDataSettings.
Surface | 1 |  Override the EnergyDataSettings values for the surface.
Invalid | -1 |  This value indicates that the parameter has not been properly set.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace